x='111'

def ne_slowa_po_russki(x):
    cnd=''
    cnd1=''
    cnd2=''
    
    ans=[]
    m=['1','2','3','4','5','6','7','8','9']
    m3=['11','12','13','14','15','16','17','18','19']
    ma=['один','два','три','четыре','пять','шесть','семь','восемь','девять']
    ma1=['десять','двадцать','тридцать','сорок','пятьдесят','шестьдесят','семьдесят','восемьдесят','девяносто']
    ma2=['сто','двести','триста','четыреста','пятьcот','шестьсот','семьсот','восемьсот','девятьсот']
    ma3 = ['одиннадцать','двенадцать','тринадцать','четырнадцать','пятнадцать','шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать']
    for i in range(9):
        if len(x)==3:
            if x[1]==1 and x[0]!=0:
                if x[1]+x[2]==
            
            
            if x[2]==m[i]:
                cnd+=ma[i]
            if x[1]==m[i]:
                cnd1+=ma1[i]
            if x[0]==m[i]:
                cnd2+=ma2[i]
        
        
        elif len(x)==2:
            if x[1]==m[i]:
                cnd=ma[i]
            if x[0]==m[i]:
                cnd1=ma1[i]
        elif len(x)==1:
            if x[0]==m[i]:
                cnd=ma[i]
    ans.append(cnd)
    ans.append(cnd1)
    ans.append(cnd2)
    ans.reverse()
    print(' '.join(ans))
ne_slowa_po_russki(x)